app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 5]]
---
  def find_recipe
  	@recipe = Recipe.find_by(id: params[:id])

SELECT "tags".* FROM "tags"
---
  def find_tags
    @tags = Tag.all

SELECT "recipes".* FROM "recipes" WHERE (title LIKE '%Macaroon')  ORDER BY title asc
SELECT "recipes".* FROM "recipes"  ORDER BY title asc
SELECT  "recipes".* FROM "recipes" WHERE (title LIKE '%Asian%')  ORDER BY stars desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "recipes" WHERE (title LIKE '%s%')
---
  def index
  	if params["keyword"].present?
      @recipes = Recipe.where("title LIKE ?", "%#{params[:keyword]}%")
    else
      @recipes = Recipe.all
    end

    @recipes = @recipes.order('stars desc').paginate(:page => params[:page],:per_page => 10)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  ORDER BY date desc  [["recipe_id", 34]]
---
  def show
  	if @recipe == nil
  		redirect_to recipes_url, notice: "recipe not found."
    else
      @tags = @recipe.tags
  	end
    @review = Review.new
    @reviews = Review.where(recipe_id: @recipe.id).order('date desc')

INSERT INTO "recipes" ("title", "photo_url", "ingredients", "instruction", "duration", "date", "stars", "user_id", "num_reviews") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."recipe_id" = ?  [["recipe_id", 57]]
INSERT INTO "categories" ("recipe_id", "tag_id") VALUES (?, ?)  [["recipe_id", 57], ["tag_id", 39]]
---
  def create
    @recipe = Recipe.new
    @recipe.title = params[:title]
    @recipe.photo_url = params[:photo_url]
    @recipe.ingredients = params[:ingredients]
    @recipe.instruction = params[:instruction]
    @recipe.duration = params[:duration]
    @recipe.date = Time.now
    @recipe.stars = 0
    @recipe.num_reviews = 0
    @recipe.user_id = session["user_id"]
    @recipe.transaction do
      @recipe.save
      @recipe.categories.each do |rc|
        rc.delete
      end
      @tags.each do |tag|
        if params["TagID#{tag.id}"].present?
          cate = Category.new
          cate.recipe_id = @recipe.id
          cate.tag_id = tag.id
          cate.save

SELECT "tags".* FROM "tags" INNER JOIN "categories" ON "tags"."id" = "categories"."tag_id" WHERE "categories"."recipe_id" = ?  [["recipe_id", 55]]
---
  def edit
    tags = @recipe.tags
    @marked = {}
    tags.each do |tag|

UPDATE "recipes" SET "ingredients" = ?, "date" = ? WHERE "recipes"."id" = ?  [["ingredients", "    Ingredien"], ["date", "2015-05-20 20:14:40.963286"], ["id", 33]]
SELECT "categories".* FROM "categories" WHERE "categories"."recipe_id" = ?  [["recipe_id", 55]]
INSERT INTO "categories" ("recipe_id", "tag_id") VALUES (?, ?)  [["recipe_id", 55], ["tag_id", 37]]
---
  def update
    @recipe.transaction do
      @recipe.title = params[:title]
      @recipe.ingredients = params[:ingredients]
      @recipe.date = Time.now
      @recipe.instruction = params[:instruction]
      @recipe.photo_url = params[:photo_url]
      @recipe.save

      @recipe.categories.each do |rc|
        rc.delete
      end
      @tags.each do |tag|
        if params["TagID#{tag.id}"].present?
          cate = Category.new
          cate.recipe_id = @recipe.id
          cate.tag_id = tag.id
          cate.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 54]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 111]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 5]]
---
  def destroy
    @recipe.transaction do
      reviews = @recipe.reviews
      reviews.each do |review|
        review.delete
      end
      @recipe.delete