app/controllers/recipes_controller.rb

  def find_recipe
  	@recipe = Recipe.find_by(id: params["id"])
  	#Todo : generate stars from reviews
  	@recipe.stars = 4
  	@recipe.save
---
UPDATE "recipes" SET "stars" = ? WHERE "recipes"."id" = ?  [["stars", 4], ["id", 11]]