app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 30]]
---
  def destroy
    review = Review.find_by(id: params[:id])