app/controllers/reviews_controller.rb

  def create
    @review = Review.new
    @review.title = params[:title]
    @review.comment = params[:comment]
    @review.date = Time.now
    @review.stars = params[:stars].to_i
    @review.recipe_id = params[:recipe_id]
    @review.user_id = session[:user_id]
    @review.transaction do
      @review.save
      recipe = @review.recipe
      recipe.num_reviews += 1
      recipe.stars = recipe.reviews.sum(:stars) / recipe.num_reviews
      recipe.save
    end
    @reviews = Review.where(recipe_id: params[:recipe_id]).order('date desc')
    if @review.errors.present?
      @recipe = Recipe.find_by(:id => params[:recipe_id])
---
INSERT INTO "reviews" ("title", "comment", "date", "stars", "recipe_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "This is good"], ["comment", "hahaha"], ["date", "2015-05-21 19:59:45.960309"], ["stars", 1], ["recipe_id", 34], ["user_id", 7]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  ORDER BY date desc  [["recipe_id", 35]]
SELECT SUM("reviews"."stars") FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 44]]
UPDATE "recipes" SET "num_reviews" = ?, "stars" = ? WHERE "recipes"."id" = ?  [["num_reviews", 5], ["stars", 4], ["id", 44]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 35]]

  def destroy
    @review.transaction do
      @review.delete
      recipe = @review.recipe
      recipe.num_reviews = recipe.num_reviews - 1
      recipe.stars = recipe.reviews.sum(:stars)/recipe.num_reviews
      recipe.save
    end
    @reviews = Review.where(recipe_id: params[:recipe_id]).order('date desc')
    if @review.errors.present?
      @recipe = Recipe.find_by(:id => params[:recipe_id])
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 30]]
SELECT SUM("reviews"."stars") FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 47]]
UPDATE "recipes" SET "num_reviews" = ?, "stars" = ? WHERE "recipes"."id" = ?  [["num_reviews", 6], ["stars", 3], ["id", 47]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 47]]