app/controllers/sessions_controller.rb

	def create
		user = User.find_by(user_name: params[:user_name])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "myu5"]]