app/controllers/tags_controller.rb

SELECT  "recipes".* FROM "recipes" INNER JOIN "categories" ON "recipes"."id" = "categories"."recipe_id" WHERE "categories"."tag_id" = ? LIMIT 1 OFFSET 0  [["tag_id", 73]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 22]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "categories" ON "recipes"."id" = "categories"."recipe_id" WHERE "categories"."tag_id" = ?  [["tag_id", 37]]
---
	def show
		@recipes = Tag.find_by(id: params[:id]).recipes.paginate(:page => params[:page], :per_page => 10)