app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password", "email", "gender", "create_date", "photo_url", "background") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_name", "myu5"], ["password", "myu5"], ["email", "myu5@example.com"], ["gender", "Male"], ["create_date", "2015-05-17 21:17:12.110746"], ["photo_url", "rqwe"], ["background", "qwte"]]
---
	def create
		@user = User.new
		@user.user_name= params[:user_name]
		@user.password= params[:password]
		@user.email= params[:email]
		@user.gender= params[:gender]
		@user.create_date= Time.now

UPDATE "users" SET "photo_url" = ? WHERE "users"."id" = ?  [["photo_url", "https://7b1bd09a8869e86c5e63-82dddf4e37e66a45e3cf59da57329a40.ssl.cf2.rackcdn.com/static/images/anonymousUser.jpg"], ["id", 19]]
---
	def update
		@user.user_name = params[:user_name]
		@user.email = params[:email]
		@user.gender = params[:gender]
		if params[:photo_url].present? && params[:photo_url] != ""
			@user.photo_url = params[:photo_url]
		else
			@user.photo_url = "default-user-image.png"
		end

		@user.background = params[:background]
		puts @user.password
		if @user.save

UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$qEuIXdljaagTHFw1koiQA.3AMvNpP7ikPIH8hp3c07v98z5bGMkMm"], ["id", 19]]
---
	def update_password
		if @user.authenticate(params[:old_password])

			if params[:new_password]==params[:confirm_password]
				@user.password = params[:new_password]
				if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "mnier2"]]
SELECT  1 AS one FROM "users" WHERE ("users"."email" = 'mymyu6@gmail.com' AND "users"."id" != 49) LIMIT 1
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$b8yhuaYD5YzNM9gKopg.0.cxRpTF9wLtPmAbQRr0Z/45mSrvTMBwu"], ["id", 49]]
---
	def send_password
		send_to = params[:email_address]
		user = User.find_by(:email => send_to)
		if !user.present?
			redirect_to forget_password_path, notice: "Email Address Not Found!!"
			return
		end

		user.password = generate_password
		if !user.save